# Chapter 9: The GroupBy object

## 9.1 Creating a GroupBy object from scratch

In [1]:
import pandas as pd

In [2]:
food_data = {
    "Item": ["Banana", "Cucumber", "Orange", "Tomato", "Watermelon"],
    "Type": ["Fruit", "Vegetable", "Fruit", "Vegetable", "Fruit"],
    "Price": [0.99, 1.25, 0.25, 0.33, 3.00]
}

supermarket = pd.DataFrame(data=food_data)

supermarket

         Item       Type  Price
0      Banana      Fruit   0.99
1    Cucumber  Vegetable   1.25
2      Orange      Fruit   0.25
3      Tomato  Vegetable   0.33
4  Watermelon      Fruit   3.00

In [3]:
groups =  supermarket.groupby("Type")
groups

In [4]:
# pull out the "Fruit" rows
groups.get_group("Fruit")

         Item   Type  Price
0      Banana  Fruit   0.99
2      Orange  Fruit   0.25
4  Watermelon  Fruit   3.00

In [5]:
# pull out the "Vegetable"  rows
groups.get_group("Vegetable")

       Item       Type  Price
1  Cucumber  Vegetable   1.25
3    Tomato  Vegetable   0.33

In [6]:
groups.mean(numeric_only=True)

              Price
Type
Fruit      1.413333
Vegetable  0.790000